en_ru = {
    'q': 'й', 'w': 'ц', 'e': 'у', 'r': 'к', 't': 'е', 'y': 'н', 'u': 'г', 'i': 'ш',
    'o': 'щ', 'p': 'з', '[': 'х', ']': 'ъ', '{': 'х', '}': 'ъ', 'a': 'ф', 's': 'ы', 'd': 'в',
    'f': 'а', 'g': 'п', 'h': 'р', 'j': 'о', 'k': 'л', 'l': 'д', ';': 'ж', """'""": 'э',
    '"': 'э', ':': 'ж', 'z': 'я', 'x': 'ч', 'c': 'с', 'v': 'м', 'b': 'и', 'n': 'т', 'm': 'ь', ',': 'б', '.': 'ю', '<': 'б', '>': 'ю',
    ' ': ' ', '/': '.', '?': ',', '&': '?'


}
ru_en = {'й': 'q', 'ц': 'w', 'у': 'e', 'к': 'r', 'е': 't', 'н': 'y', 'г': 'u', 'ш': 'i', 'щ': 'o', 'з': 'p', 'х': '[{', 'ъ': ']}', 'ф': 'a',
         'ы': 's', 'в': 'd', 'а': 'f', 'п': 'g', 'р': 'h', 'о': 'j', 'л': 'k', 'д': 'l',
         'ж': ';:', 'э': '\'"', 'я': 'z', 'ч': 'x', 'с': 'c', 'м': 'v',
         'и': 'b', 'т': 'n', 'ь': 'm', 'б': ',<', 'ю': '.>', ' ': ' ', '.': '/', ',': '?', '?': '&'}

try:
    line = list(input().lower())
except KeyboardInterrupt:
    print('\nВыход')
except EOFError:
    print('Конец файла')
else:
    res = []
    for i in line:
        res.append(en_ru.get(i, ''))
    print(''.join(res).capitalize())
    input()